# Pandas

In [4]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame(np.arange(0, 30).reshape(5,6), index=['Row1', 'Row2', 'Row3', 'Row4', 'Row5'], columns=['Column1', 'Column2', 'Column3', 'Column4', 'Column5', 'Column6'])
# Display the DataFrame
print(df)

      Column1  Column2  Column3  Column4  Column5  Column6
Row1        0        1        2        3        4        5
Row2        6        7        8        9       10       11
Row3       12       13       14       15       16       17
Row4       18       19       20       21       22       23
Row5       24       25       26       27       28       29

In [6]:
df.to_csv('data.csv')

In [7]:
df.loc['Row3']

Column1    12
Column2    13
Column3    14
Column4    15
Column5    16
Column6    17
Name: Row3, dtype: int64

In [8]:
df.iloc[:,:]

      Column1  Column2  Column3  Column4  Column5  Column6
Row1        0        1        2        3        4        5
Row2        6        7        8        9       10       11
Row3       12       13       14       15       16       17
Row4       18       19       20       21       22       23
Row5       24       25       26       27       28       29

In [9]:
df.iloc[3:5, :]

      Column1  Column2  Column3  Column4  Column5  Column6
Row4       18       19       20       21       22       23
Row5       24       25       26       27       28       29

In [10]:
df = pd.read_csv("csv_data.csv") #reads csv file
df

,First Name,Last Name,School,College,Grade (Intermediate),State
0,Arin,Sharma,St. Vishna RRN School,Mangalayatan University,65%,Uttar Pradesh
1,Advik,Verma,Kendriya Vidyalaya,"National Law University, Delhi",68%,Uttarakhand
2,Vishal,Verma,Kendriya Vidyalaya,National Defence Academy,86%,Uttarakhand
3,Vikas,Singh,Kendriya Vidyalaya,AIIMS (Delhi),88%,Bihar
4,Vaishnavi,Singh,Kendriya Vidyalaya,NIT Kurukshetra,84%,Haryana
5,Rishita,Bhatt,Kendriya Vidyalaya,IIT Roorkee,99.20%,Gujarat

In [11]:
data = pd.read_json("json_data.json") #reads json data
data.head() #lists first 5 data

,id,title,slug,description,price,instructor,isFeatured,image
0,1,Guitar Fundamentals,guitar-fundamentals,Learn the basics of playing guitar with our co...,99.99,John Doe,True,https://images.unsplash.com/photo-152520154086...
1,2,Advanced Jazz Piano,advanced-jazz-piano,"Explore complex chords, improvisation, and jaz...",149.99,Sarah Chen,False,https://images.unsplash.com/photo-1549419615-5...
2,3,Drums: Rhythm Mastery,drums-rhythm-mastery,Techniques for various drumming styles includi...,119.50,Mike Johnson,True,https://images.unsplash.com/photo-1558296245-7...
3,4,Vocal Training for Beginners,vocal-training-beginners,"Improve pitch, breathing control, and vocal ra...",89.00,Aisha Khan,False,https://images.unsplash.com/photo-157777748450...
4,5,Music Production in Ableton,music-production-ableton,"From recording to mixing, master the digital a...",199.99,Alex Rodriguez,True,https://images.unsplash.com/photo-151860013917...

In [12]:
data = pd.read_excel("excel_data.xlsx") #reads excel data
data.tail() #reads last 5 data

,First Name,Last Name,School,College,Grade (Intermediate),State
1,Advik,Verma,Kendriya Vidyalaya,"National Law University, Delhi",0.680,Uttarakhand
2,Vishal,Verma,Kendriya Vidyalaya,National Defence Academy,0.860,Uttarakhand
3,Vikas,Singh,Kendriya Vidyalaya,AIIMS (Delhi),0.880,Bihar
4,Vaishnavi,Singh,Kendriya Vidyalaya,NIT Kurukshetra,0.840,Haryana
5,Rishita,Bhatt,Kendriya Vidyalaya,IIT Roorkee,0.992,Gujarat

In [13]:
#Creating Data
data = {
    "Name": ["Arin", "Rishita", "Advik"],
    "Age": [21, 21, 20],
    "State": ["Uttar Pradesh", "Gujarat", "Uttarakhand"]
}

In [14]:
df = pd.DataFrame(data) #creating data into dataframe
df

      Name  Age          State
0     Arin   21  Uttar Pradesh
1  Rishita   21        Gujarat
2    Advik   20    Uttarakhand

In [15]:
df.to_csv("data.csv", index=False) #creates data into csv file

In [16]:
df.to_excel("data.xlsx", index=False)  #creates data into excel file

In [38]:
df.to_json("data.json", index=False)  #creates data into json file
df

        Name  Grade           State  Gender  Salary
0       Arin     65   Uttar Pradesh    Male   60000
1    Rishita     99         Gujarat  Female  950000
2  Vaishnavi     84         Haryana  Female   40000
3      Advik     68     Uttarakhand    Male   20000
4     Vishal     86     Uttarakhand    Male   10000
5    Radhika     88  Madhya Pradesh  Female   65000

In [ ]:
df = pd.read_csv("csv_data.csv") #reads csv file
df

,First Name,Last Name,School,College,Grade (Intermediate),State
0,Arin,Sharma,St. Vishna RRN School,Mangalayatan University,65%,Uttar Pradesh
1,Advik,Verma,Kendriya Vidyalaya,"National Law University, Delhi",68%,Uttarakhand
2,Vishal,Verma,Kendriya Vidyalaya,National Defence Academy,86%,Uttarakhand
3,Vikas,Singh,Kendriya Vidyalaya,AIIMS (Delhi),88%,Bihar
4,Vaishnavi,Singh,Kendriya Vidyalaya,NIT Kurukshetra,84%,Haryana
5,Rishita,Bhatt,Kendriya Vidyalaya,IIT Roorkee,99.20%,Gujarat

In [19]:
df.head(1) #return first data

,First Name,Last Name,School,College,Grade (Intermediate),State
0,Arin,Sharma,St. Vishna RRN School,Mangalayatan University,65%,Uttar Pradesh

In [20]:
df.tail(1) #return last data

,First Name,Last Name,School,College,Grade (Intermediate),State
5,Rishita,Bhatt,Kendriya Vidyalaya,IIT Roorkee,99.20%,Gujarat

In [21]:
df.info() #returns data summary

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   First Name            6 non-null      object
 1   Last Name             6 non-null      object
 2   School                6 non-null      object
 3   College               6 non-null      object
 4   Grade (Intermediate)  6 non-null      object
 5   State                 6 non-null      object
dtypes: object(6)
memory usage: 420.0+ bytes

In [22]:
df.describe()

,First Name,Last Name,School,College,Grade (Intermediate),State
count,6,6,6,6,6,6
unique,6,4,2,6,6,5
top,Arin,Verma,Kendriya Vidyalaya,Mangalayatan University,65%,Uttarakhand
freq,1,2,5,1,1,2

In [23]:
#Creating Data
data = {
    "Name": ["Arin", "Rishita", "Vaishnavi", "Advik", "Vishal", "Radhika"],
    "Grade": [65, 99, 84, 68, 86, 88],
    "State": ["Uttar Pradesh", "Gujarat", "Haryana","Uttarakhand", "Uttarakhand", "Madhya Pradesh"],
    "Gender": ["Male", "Female", "Female", "Male","Male", "Female"],
    "Salary": [60000, 950000, 40000, 20000, 10000, 65000]
}
df = pd.DataFrame(data)
df

        Name  Grade           State  Gender  Salary
0       Arin     65   Uttar Pradesh    Male   60000
1    Rishita     99         Gujarat  Female  950000
2  Vaishnavi     84         Haryana  Female   40000
3      Advik     68     Uttarakhand    Male   20000
4     Vishal     86     Uttarakhand    Male   10000
5    Radhika     88  Madhya Pradesh  Female   65000

In [24]:
df.describe() # generate descriptive statistics of a dataFrame

           Grade         Salary
count   6.000000       6.000000
mean   81.666667  190833.333333
std    12.878923  372537.470151
min    65.000000   10000.000000
25%    72.000000   25000.000000
50%    85.000000   50000.000000
75%    87.500000   63750.000000
max    99.000000  950000.000000

#### Knowing column and shape of dataset

In [25]:
df.shape #returns shape

(6, 5)

In [26]:
df.columns #returns columns

Index(['Name', 'Grade', 'State', 'Gender', 'Salary'], dtype='object')

#### Filtering based on condition

In [27]:
salary = df[df["Salary"]> 50000]
salary

      Name  Grade           State  Gender  Salary
0     Arin     65   Uttar Pradesh    Male   60000
1  Rishita     99         Gujarat  Female  950000
5  Radhika     88  Madhya Pradesh  Female   65000

In [28]:
lower_salary = df[(df["Salary"] > 10000) & (df["Salary"] < 50000)]
lower_salary

        Name  Grade        State  Gender  Salary
2  Vaishnavi     84      Haryana  Female   40000
3      Advik     68  Uttarakhand    Male   20000

In [29]:
df["Name"] #returns single column

0         Arin
1      Rishita
2    Vaishnavi
3        Advik
4       Vishal
5      Radhika
Name: Name, dtype: object

In [30]:
df[["Name", "Salary"]] #returns multiple columns

        Name  Salary
0       Arin   60000
1    Rishita  950000
2  Vaishnavi   40000
3      Advik   20000
4     Vishal   10000
5    Radhika   65000

In [31]:
higher_rankers = df[(df["Grade"] > 85) & (df["Grade"] < 90)]
higher_rankers

      Name  Grade           State  Gender  Salary
4   Vishal     86     Uttarakhand    Male   10000
5  Radhika     88  Madhya Pradesh  Female   65000

In [32]:
passed = df[(df["Grade"] > 50) & (df["Grade"] < 70)]
passed

    Name  Grade          State Gender  Salary
0   Arin     65  Uttar Pradesh   Male   60000
3  Advik     68    Uttarakhand   Male   20000

In [33]:
df

        Name  Grade           State  Gender  Salary
0       Arin     65   Uttar Pradesh    Male   60000
1    Rishita     99         Gujarat  Female  950000
2  Vaishnavi     84         Haryana  Female   40000
3      Advik     68     Uttarakhand    Male   20000
4     Vishal     86     Uttarakhand    Male   10000
5    Radhika     88  Madhya Pradesh  Female   65000

In [34]:
successfull = df[(df["Grade"] > 70) | (df["Salary"] > 15000)]
successfull

        Name  Grade           State  Gender  Salary
0       Arin     65   Uttar Pradesh    Male   60000
1    Rishita     99         Gujarat  Female  950000
2  Vaishnavi     84         Haryana  Female   40000
3      Advik     68     Uttarakhand    Male   20000
4     Vishal     86     Uttarakhand    Male   10000
5    Radhika     88  Madhya Pradesh  Female   65000

In [42]:
url = 'https://www.fdic.gov/bank/individual/failed/banklist.html'
dfs = pd.read_html(url)

In [43]:
dfs[0]

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
1,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
2,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,First Bank & Trust Co.,"October 18, 2024",10547
3,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
4,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
5,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
6,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
7,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
8,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
9,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
10,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
11,The First State Bank,Barboursville,West Virginia,14361,"MVB Bank, Inc.","April 3, 2020",10536
12,Ericson State Bank,Ericson,Nebraska,18265,Farmers and Merchants Bank,"February 14, 2020",10535
13,City National Bank of New Jersey,Newark,New Jersey,21111,Industrial Bank,"November 1, 2019",10534
14,Resolute Bank,Maumee,Ohio,58317,Buckeye State Bank,"October 25, 2019",10533
15,Louisa Community Bank,Louisa,Kentucky,58112,Kentucky Farmers Bank Corporation,"October 25, 2019",10532
16,The Enloe State Bank,Cooper,Texas,10716,"Legend Bank, N. A.","May 31, 2019",10531
17,Washington Federal Bank for Savings,Chicago,Illinois,30570,Royal Savings Bank,"December 15, 2017",10530
18,The Farmers and Merchants State Bank of Argonia,Argonia,Kansas,17719,Conway Bank,"October 13, 2017",10529
19,Fayette County Bank,Saint Elmo,Illinois,1802,"United Fidelity Bank, fsb","May 26, 2017",10528
20,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,Wisconsin,30003,First-Citizens Bank & Trust Company,"May 5, 2017",10527
21,First NBC Bank,New Orleans,Louisiana,58302,Whitney Bank,"April 28, 2017",10526
22,Proficio Bank,Cottonwood Heights,Utah,35495,Cache Valley Bank,"March 3, 2017",10525
23,Seaway Bank and Trust Company,Chicago,Illinois,19328,State Bank of Texas,"January 27, 2017",10524
24,Harvest Community Bank,Pennsville,New Jersey,34951,First-Citizens Bank & Trust Company,"January 13, 2017",10523

In [44]:
country_code = 'https://en.wikipedia.org/wiki/Mobile_country_code'
dfs = pd.read_html(country_code, match='Mobile Network Codes', header=0)

HTTPError: HTTP Error 403: Forbidden